tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/include/apm32f00x.h
#ifndef NULL
#define NULL    ((void *)0)
#endif

#if defined (__CC_ARM )
#pragma anon_unions
#endif

/** @addtogroup Device_Register Register
  @{
*/

/**
  * @brief  General Purpose I/Os (GPIO)
  */
typedef struct
{
    /** Data output register */
    union
    {
        __IOM uint32_t DOUT;

        struct
        {
            __IOM uint32_t DOUT0            : 1;
            __IOM uint32_t DOUT1            : 1;
            __IOM uint32_t DOUT2            : 1;
            __IOM uint32_t DOUT3            : 1;
            __IOM uint32_t DOUT4            : 1;
            __IOM uint32_t DOUT5            : 1;
            __IOM uint32_t DOUT6            : 1;
            __IOM uint32_t DOUT7            : 1;
            __IM  uint32_t RESERVED         : 24;
        } DOUT_B;
    } ;

    /** Data input register */
    union
    {
        __IOM uint32_t DIN;

        struct
        {
            __IOM uint32_t DIN0             : 1;
            __IOM uint32_t DIN1             : 1;
            __IOM uint32_t DIN2             : 1;
            __IOM uint32_t DIN3             : 1;
            __IOM uint32_t DIN4             : 1;
            __IOM uint32_t DIN5             : 1;
            __IOM uint32_t DIN6             : 1;
            __IOM uint32_t DIN7             : 1;
            __IM  uint32_t RESERVED         : 24;
        } DIN_B;
    } ;

    /** input / ouput mode register */
    union
    {
        __IOM uint32_t MODE;

        struct
        {
            __IOM uint32_t MODE0            : 1;
            __IOM uint32_t MODE1            : 1;
            __IOM uint32_t MODE2            : 1;
            __IOM uint32_t MODE3            : 1;
            __IOM uint32_t MODE4            : 1;
            __IOM uint32_t MODE5            : 1;
            __IOM uint32_t MODE6            : 1;
            __IOM uint32_t MODE7            : 1;
            __IM  uint32_t RESERVED         : 24;
        } MODE_B;
    } ;

    /** Control Register 1 */
    union
    {
        __IOM uint32_t CTRL1;

        struct
        {
            __IOM uint32_t CR0              : 1;
            __IOM uint32_t CR1              : 1;
            __IOM uint32_t CR2              : 1;
            __IOM uint32_t CR3              : 1;
            __IOM uint32_t CR4              : 1;
            __IOM uint32_t CR5              : 1;
            __IOM uint32_t CR6              : 1;
            __IOM uint32_t CR7              : 1;
            __IM  uint32_t RESERVED         : 24;
        } CTRL1_B;
    } ;

    /** Control Register 2 */
    union
    {
        __IOM uint32_t CTRL2;

        struct
        {
            __IOM uint32_t CR0              : 1;
            __IOM uint32_t CR1              : 1;
            __IOM uint32_t CR2              : 1;
            __IOM uint32_t CR3              : 1;
            __IOM uint32_t CR4              : 1;
            __IOM uint32_t CR5              : 1;
            __IOM uint32_t CR6              : 1;
            __IOM uint32_t CR7              : 1;
            __IM  uint32_t RESERVED         : 24;
        } CTRL2_B;
    } ;
    
    __IM uint32_t RESERVED1;
    __IM uint32_t RESERVED2;
    __IM uint32_t RESERVED3;
    __IM uint32_t RESERVED4;
    __IM uint32_t RESERVED5;
    __IM uint32_t RESERVED6;
    __IM uint32_t RESERVED7;
    __IM uint32_t RESERVED8;
    __IM uint32_t RESERVED9;
    __IM uint32_t RESERVED10;
    __IM uint32_t RESERVED11;
    __IM uint32_t RESERVED12;
    __IM uint32_t RESERVED13;
    __IM uint32_t RESERVED14;
    __IM uint32_t RESERVED15;
    __IM uint32_t RESERVED16;
    __IM uint32_t RESERVED17;
    __IM uint32_t RESERVED18;
    __IM uint32_t RESERVED19;
    __IM uint32_t RESERVED20;
    __IM uint32_t RESERVED21;
    __IM uint32_t RESERVED22;
    __IM uint32_t RESERVED23;
    __IM uint32_t RESERVED24;
    __IM uint32_t RESERVED25;
    __IM uint32_t RESERVED26;
    __IM uint32_t RESERVED27;
    __IM uint32_t RESERVED28;
    __IM uint32_t RESERVED29;
    __IM uint32_t RESERVED30;
    __IM uint32_t RESERVED31;
    __IM uint32_t RESERVED32;
    __IM uint32_t RESERVED33;
    __IM uint32_t RESERVED34;
    __IM uint32_t RESERVED35;
    
    /** GPIO JTAGDIS Register */
    union
    {
        __IOM uint32_t GPIO_JTAGDIS;

        struct
        {
            __IOM uint32_t JTAGDIS          : 1;
            __IM  uint32_t RESERVED         : 31;
        } JTAGDIS_B;
    } ;
} GPIO_T;

/**
  * @brief  Reset and Clock Management (RCM)
  */
typedef struct
{
    /** Internal clock control register */
    union
    {
        __IOM uint32_t ICC;

        struct
        {
            __IOM uint32_t HIRCEN           : 1;
            __IM  uint32_t HIRCRF           : 1;
            __IOM uint32_t FWFHEN           : 1;
            __IOM uint32_t LIRCEN           : 1;
            __IM  uint32_t LIRCRF           : 1;
            __IOM uint32_t RPOEN            : 1;
            __IM  uint32_t RESERVED         : 26;
        } ICC_B;
    } ;

    /** External clock control register */
    union
    {
        __IOM uint32_t ECC;

        struct
        {
            __IOM uint32_t HXTEN            : 1;
            __IM  uint32_t HXTRF            : 1;
            __IM  uint32_t RESERVED         : 30;
        } ECC_B;
    } ;

    __IM uint32_t RESERVED1;

    /** Master Clock status register */
    union
    {
        __IOM uint32_t MCS;

        struct
        {
            __IOM uint32_t MCS              : 8;
            __IM  uint32_t RESERVED         : 24;
        } MCLKSTS_B;
    } ;

    /** Master Clock selection register */
    union
    {
        __IOM uint32_t MCC;

        struct
        {
            __IOM uint32_t MCC              : 8;
            __IM  uint32_t RESERVED         : 24;
        } MCC_B;
    } ;

    /** Master Clock switch control register */
    union
    {
        __IOM uint32_t CSC;

        struct
        {
            __IOM uint32_t CSBF             : 1;
            __IOM uint32_t CSEN             : 1;
            __IOM uint32_t CSIE             : 1;
            __IOM uint32_t CSIF             : 1;
            __IM  uint32_t RESERVED         : 28;
        } CSC_B;
    } ;

    /** Clock divider number register */
    union
    {
        __IOM uint32_t CLKDIV;

        struct
        {
            __IOM uint32_t CPUDIV           : 3;
            __IOM uint32_t HIRCDIV          : 2;
            __IOM uint32_t HDS              : 1;
            __IM  uint32_t RESERVED         : 26;
        } CLKDIV_B;
    } ;

    /** APB peripheral clock enable register1 */
    union
    {
        __IOM uint32_t APBEN1;

        struct
        {
            __IOM uint32_t I2CCEN           : 1;
            __IOM uint32_t SPICEN           : 1;
            __IOM uint32_t RESERVED1        : 1;
            __IOM uint32_t USART1CEN        : 1;
            __IOM uint32_t TMR4CEN          : 1;
            __IOM uint32_t TMR2CEN          : 1;
            __IOM uint32_t RESERVED2        : 1;
            __IOM uint32_t TMR1CEN          : 1;
            __IM  uint32_t RESERVED3        : 24;
        } APBEN1_B;
    } ;

    /** Clock security system register */
    union
    {
        __IOM uint32_t CSS;

        struct
        {
            __IOM uint32_t CSSEN            : 1;
            __IOM uint32_t BCEN             : 1;
            __IOM uint32_t CSSFDIE          : 1;
            __IOM uint32_t CSSFDIF          : 1;
            __IM  uint32_t RESERVED         : 28;
        } CSS_B;
    } ;

    /** clock output control register */
    union
    {
        __IOM uint32_t COC;

        struct
        {
            __IOM uint32_t COEN             : 1;
            __IOM uint32_t COS              : 4;
            __IM  uint32_t CORF             : 1;
            __IM  uint32_t COBF             : 1;
            __IM  uint32_t RESERVED         : 25;
        } COC_B;
    } ;

    /** APB peripheral clock enable register2 */
    union
    {
        __IOM uint32_t APBEN2;

        struct
        {
            __IM  uint32_t RESERVED1        : 2;
            __IOM uint32_t WUPTCEN          : 1;
            __IOM uint32_t ADCCEN           : 1;
            __IM  uint32_t RESERVED2        : 28;
        } APBEN2_B;
    } ;

    __IM  uint32_t RESERVED2;

    /** HIRC clock calibration trimming register */
    union
    {
        __IOM uint32_t HIRCTRIM;

        struct
        {
            __IOM uint32_t TRIM             : 4;
            __IM  uint32_t RESERVED         : 28;
        } HIRCTRIM_B;
    } ;

