tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/include/apm32f00x.h
    __IM  uint32_t RESERVED3;

    /** Reset status register */
    union
    {
        __IOM uint32_t RSTSTS;

        struct
        {
            __IM  uint32_t WWDTRF           : 1;
            __IM  uint32_t IWDTRF           : 1;
            __IM  uint32_t CPURF            : 1;
            __IM  uint32_t RESERVED1        : 1;
            __IM  uint32_t EMCRF            : 1;
            __IM  uint32_t RESERVED2        : 27;
        } RSTSTS_B;
    } ;

    /** APB peripheral clock enable register3 */
    union
    {
        __IOM uint32_t APBEN3;

        struct
        {
            __IOM uint32_t TMR1ACEN         : 1;
            __IOM uint32_t USART2CEN        : 1;
            __IOM uint32_t USART3CEN        : 1;
            __IM  uint32_t RESERVED         : 29;
        } APBEN3_B;
    } ;
} RCM_T;

/**
 * @brief    Universal synchronous asynchronous receiver transmitter (USART)
 */
typedef struct
{
    /** Status register */
    union
    {
        __IOM uint32_t STS;
        struct
        {
            __IM  uint32_t PEF              : 1;
            __IM  uint32_t FEF              : 1;
            __IM  uint32_t NEF              : 1;
            __IM  uint32_t OEF              : 1;
            __IM  uint32_t IDLEF            : 1;
            __IM  uint32_t RXBNEF           : 1;
            __IM  uint32_t TXCF             : 1;
            __IM  uint32_t TXBEF            : 1;
            __IM  uint32_t RESERVED         : 24;
        }STS_B;
    };

    /** DATA register */
    union
    {
        __IOM uint32_t DATA;
        struct
        {
            __IOM uint32_t DATA             : 8;
            __IM  uint32_t RESERVED         : 24;
        }DATA_B;
    };

    /** Baud rate register 1  */
    union
    {
        __IOM uint32_t BR1;
        struct
        {
            __IOM uint32_t DIV11_4          : 8;
            __IM  uint32_t RESERVED         : 24;
        }BR1_B;
    };

    /** Baud rate register 0  */
    union
    {
        __IOM uint32_t BR0;
        struct
        {
            __IOM uint32_t DIV3_0           : 4;
            __IOM uint32_t DIV15_12         : 4;
            __IM  uint32_t RESERVED         : 24;
        }BR0_B;
    };

    /** Control register 1  */
    union
    {
        __IOM uint32_t CTRL1;
        struct
        {
            __IOM uint32_t PIE              : 1;
            __IOM uint32_t PSEL             : 1;
            __IOM uint32_t PEN              : 1;
            __IOM uint32_t WMS              : 1;
            __IOM uint32_t DBL              : 1;
            __IOM uint32_t USARTDIS         : 1;
            __IOM uint32_t TDB8             : 1;
            __IOM uint32_t RDB8             : 1;
            __IM  uint32_t RESERVED         : 24;
        }CTRL1_B;
    };

    /** Control register 2  */
    union
    {
        __IOM uint32_t CTRL2;
        struct
        {
            __IOM uint32_t TXBRK            : 1;
            __IOM uint32_t RMM              : 1;
            __IOM uint32_t RXEN             : 1;
            __IOM uint32_t TXEN             : 1;
            __IOM uint32_t IDLEIE           : 1;
            __IOM uint32_t RXIE             : 1;
            __IOM uint32_t TXCIE            : 1;
            __IOM uint32_t TXIE             : 1;
            __IM  uint32_t RESERVED         : 24;
        }CTRL2_B;
    };

    /** Control register 3 */
    union
    {
        __IOM uint32_t CTRL3;
        struct
        {
            __IOM uint32_t LBCP             : 1;
            __IOM uint32_t CLKPHA           : 1;
            __IOM uint32_t CLKPOL           : 1;
            __IOM uint32_t CLKEN            : 1;
            __IOM uint32_t SBS              : 2;
            __IOM uint32_t LINEN            : 1;
            __IM  uint32_t RESERVED         : 25;
        }CTRL3_B;
    };

    /** Control register 4 */
    union
    {
        __IOM uint32_t CTRL4;
        struct
        {
            __IOM uint32_t ADDR             : 4;
            __IOM uint32_t LMBDF            : 1;
            __IOM uint32_t LMBDL            : 1;
            __IOM uint32_t LMBDIE           : 1;
            __IM  uint32_t RESERVED         : 25;
        }CTRL4_B;
    };

    /** Control register 5 */
    union
    {
        __IOM uint32_t CTRL5;
        struct
        {
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t IRDAEN           : 1;
            __IOM uint32_t ILPM             : 1;
            __IOM uint32_t HDMEN            : 1;
            __IOM uint32_t NACKEN           : 1;
            __IOM uint32_t SMEN             : 1;
            __IM  uint32_t RESERVED2        : 26;
        }CTRL5_B;
    };

    /** Guard time register */
    union
    {
        __IOM uint32_t GTS;
        struct
        {
            __IOM uint32_t GTS              : 8;
            __IM  uint32_t RESERVED         : 24;
        }GTS_B;
    };

    /** Divder number register */
    union
    {
        __IOM uint32_t PSC;
        struct
        {
            __IOM uint32_t PSC                : 8;
            __IM  uint32_t RESERVED         : 24;
        }DIV_B;
    };

    /** USART2/USART3 switch register */
    union
    {
        __IOM uint32_t SW;
        struct
        {
            __IOM uint32_t SW                : 1;
            __IM  uint32_t RESERVED         : 31;
        }SW_B;
    };


    /** USART3 IO switch register */
    union
    {
        __IOM uint32_t IOSW;
        struct
        {
            __IOM uint32_t SW                : 1;
            __IM  uint32_t RESERVED         : 31;
        }IOSW_B;
    };

}USART_T;


/**
 * @brief    Inter-integrated circuit interface (I2C)
 */
typedef struct
{
    /** Control register 1 */
    union
    {
        __IOM uint32_t CTRL1;
        struct
        {
            __IOM uint32_t I2CEN            : 1;
            __IM  uint32_t RESERVED1        : 5;
            __IOM uint32_t BCEN             : 1;
            __IOM uint32_t STRDIS           : 1;
            __IM  uint32_t RESERVED2        : 24;
        }CTRL1_B;
    };

