tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/include/apm32f00x.h
    /** Control register 2 */
    union
    {
        __IOM uint32_t CTRL2;
        struct
        {
            __IOM uint32_t START            : 1;
            __IOM uint32_t STOP             : 1;
            __IOM uint32_t ACKEN            : 1;
            __IOM uint32_t ACKPOS           : 1;
            __IM  uint32_t RESERVED1        : 3;
            __IOM uint32_t SWRST            : 1;
            __IM  uint32_t RESERVED2        : 24;
        }CTRL2_B;
    };

    /** Frequency Control register */
    union
    {
        __IOM uint32_t CLKFREQ;
        struct
        {
            __IOM uint32_t FREQ                : 6;
            __IM  uint32_t RESERVED            : 26;
        }CLKFREQ_B;
    };

    /** Slave address register 0 */
    union
    {
        __IOM uint32_t ADDR0;
        struct
        {
            __IOM uint32_t ADDR                : 8;
            __IM  uint32_t RESERVED            : 24;
        }ADDR0_B;
    };

    /** Slave address register 1 */
    union
    {
        __IOM uint32_t ADDR1;
        struct
        {
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t ADDR             : 2;
            __IM  uint32_t RESERVED2        : 3;
            __IOM uint32_t ADDRCFG          : 1;
            __IOM uint32_t ADDRMODE         : 1;
            __IM  uint32_t RESERVED3        : 24;
        }ADDR1_B;
    };

    __IOM uint32_t RESERVED;

    /** Data register */
    union
    {
        __IOM uint32_t DATA;
        struct
        {
            __IOM uint32_t DATA             : 8;
            __IM  uint32_t RESERVED         : 24;
        }DATA_B;
    };

    /** Status register 1 */
    union
    {
        __IOM uint32_t STS1;
        struct
        {
            __IOM uint32_t SBTCF            : 1;
            __IOM uint32_t ADDRF            : 1;
            __IOM uint32_t BTCF             : 1;
            __IOM uint32_t ADDR10F          : 1;
            __IOM uint32_t SBDF             : 1;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t RXBNEF           : 1;
            __IOM uint32_t TXBEF            : 1;
            __IM  uint32_t RESERVED2        : 24;
        }STS1_B;
    };

    /** Status register 2 */
    union
    {
        __IOM uint32_t STS2;
        struct
        {
            __IOM uint32_t BEF              : 1;
            __IOM uint32_t ALF              : 1;
            __IOM uint32_t AEF              : 1;
            __IOM uint32_t OUF              : 1;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t WFHF             : 1;
            __IM  uint32_t RESERVED2        : 26;
        }STS2_B;
    };

    /** Status register 3 */
    union
    {
        __IOM uint32_t STS3;
        struct
        {
            __IOM uint32_t MMF              : 1;
            __IOM uint32_t BUSYF            : 1;
            __IOM uint32_t RWMF             : 1;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t RBF              : 1;
            __IM  uint32_t RESERVED2        : 27;
        }STS3_B;
    };

    /** Interrupt control register */
    union
    {
        __IOM uint32_t INTCTRL;
        struct
        {
            __IOM uint32_t ERRIE            : 1;
            __IOM uint32_t EVTIE            : 1;
            __IOM uint32_t BUFIE            : 1;
            __IM  uint32_t RESERVED         : 29;
        }INTCTRL_B;
    };

    /** Clock control register 1 */
    union
    {
        __IOM uint32_t CLKCTRL1;
        struct
        {
            __IOM uint32_t CLKCTRL          : 8;
            __IM  uint32_t RESERVED         : 24;
        }CLKCTRL1_B;
    };

    /** Clock control register 2 */
    union
    {
        __IOM uint32_t CLKCTRL2;
        struct
        {
            __IOM uint32_t CLKCTRL          : 4;
            __IM  uint32_t RESERVED1        : 2;
            __IOM uint32_t FMDC             : 1;
            __IOM uint32_t FASTMODE         : 1;
            __IM  uint32_t RESERVED2        : 24;
        }CLKCTRL2_B;
    };

    /** Max Rise time register */
    union
    {
        __IOM uint32_t MRT;
        struct
        {
            __IOM uint32_t MRT              : 6;
            __IM  uint32_t RESERVED         : 26;
        }TRIM_B;
    };
}I2C_T;

/**
 * @brief   Timer1/Timer1A
 */
typedef struct
{
    /** Control register 1 */
    union
    {
        __IOM uint32_t CTRL1;
        struct
        {
            __IOM uint32_t CNTEN            : 1;
            __IOM uint32_t NGUE             : 1;
            __IOM uint32_t UES              : 1;
            __IOM uint32_t SPMEN            : 1;
            __IOM uint32_t CNTDIR           : 1;
            __IOM uint32_t CNTMODE          : 2;
            __IOM uint32_t ARBEN            : 1;
            __IM  uint32_t RESERVED         : 24;
        }CTRL1_B;
    };

    /** Control register 2 */
    union
    {
        __IOM uint32_t CTRL2;
        struct
        {
            __IOM uint32_t CCBEN            : 1;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t CCUS             : 1;
            __IOM uint32_t RESERVED2        : 1;
            __IOM uint32_t MMFC             : 3;
            __IM  uint32_t RESERVED3        : 25;
        }CTRL2_B;
    };

    /** Slave mode congrol register */
    union
    {
        __IOM uint32_t SMC;
        struct
        {
            __IOM uint32_t SMFC             : 3;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t ITC              : 3;
            __IOM uint32_t MSMEN            : 1;
            __IM  uint32_t RESERVED2        : 24;
        }SMC_B;
    };

    /** External trigger control register */
    union
    {
        __IOM uint32_t ETC;
        struct
        {
            __IOM uint32_t ETFC             : 4;
            __IOM uint32_t ETRC             : 2;
            __IOM uint32_t ECM2EN           : 1;
            __IOM uint32_t ETPC             : 1;
            __IM  uint32_t RESERVED         : 24;
        }ETC_B;
    };

    /** interrupt control register */
    union
    {
        __IOM uint32_t INTCTRL;
        struct
        {
            __IOM uint32_t UDIE             : 1;
            __IOM uint32_t CH1CCIE          : 1;
            __IOM uint32_t CH2CCIE          : 1;
            __IOM uint32_t CH3CCIE          : 1;
            __IOM uint32_t CH4CCIE          : 1;
            __IOM uint32_t CCUIE            : 1;
            __IOM uint32_t TRGIE            : 1;
            __IOM uint32_t BRKIE            : 1;
            __IM  uint32_t RESERVED         : 24;
        }INTCTRL_B;
    };

    /** status register 1 */
    union
    {
        __IOM uint32_t STS1;
        struct
        {
            __IOM uint32_t UDIF             : 1;
            __IOM uint32_t CH1CCIF          : 1;
            __IOM uint32_t CH2CCIF          : 1;
            __IOM uint32_t CH3CCIF          : 1;
            __IOM uint32_t CH4CCIF          : 1;
            __IOM uint32_t CCUIF            : 1;
            __IOM uint32_t TRGIF            : 1;
            __IOM uint32_t BRKIF            : 1;
            __IM  uint32_t RESERVED         : 24;
        }STS1_B;
    };

    /** status register 2 */
    union
    {
        __IOM uint32_t STS2;
        struct
        {
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t CH1RCF           : 1;
            __IOM uint32_t CH2RCF           : 1;
            __IOM uint32_t CH3RCF           : 1;
            __IOM uint32_t CH4RCF           : 1;
            __IM  uint32_t RESERVED2        : 27;
        }STS2_B;
    };

    /** Software control event generate register */
    union
    {
        __IOM uint32_t SCEG;
        struct
        {
            __IOM uint32_t UEG              : 1;
            __IOM uint32_t CH1CCG           : 1;
            __IOM uint32_t CH2CCG           : 1;
            __IOM uint32_t CH3CCG           : 1;
            __IOM uint32_t CH4CCG           : 1;
            __IOM uint32_t CCUEG            : 1;
            __IOM uint32_t TEG              : 1;
            __IOM uint32_t BEG              : 1;
            __IM  uint32_t RESERVED2        : 24;
        }SCEG_B;
    };

