tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/include/apm32f00x.h
    /** Channel 1 compare/capture mode register */
    union
    {
        __IOM uint32_t CH1CCM;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t OCFEN            : 1;
            __IOM uint32_t OCBEN            : 1;
            __IOM uint32_t OCMS             : 3;
            __IOM uint32_t OCCEN            : 1;
            __IM  uint32_t RESERVED         : 24;
        }CH1OC_B;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t IC1PSC           : 2;
            __IOM uint32_t ICFC             : 4;
            __IM  uint32_t RESERVED         : 24;
        }CH1IC_B;
    };

    /** Channel 2 compare/capture mode register */
    union
    {
        __IOM uint32_t CH2CCM;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t OCFEN            : 1;
            __IOM uint32_t OCBEN            : 1;
            __IOM uint32_t OCMS             : 3;
            __IOM uint32_t OCCEN            : 1;
            __IM  uint32_t RESERVED         : 24;
        }CH2OC_B;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t IC2PSC           : 2;
            __IOM uint32_t ICFC             : 4;
            __IM  uint32_t RESERVED         : 24;
        }CH2IC_B;
    };

    /** Channel 3 compare/capture mode register */
    union
    {
        __IOM uint32_t CH3CCM;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t OCFEN            : 1;
            __IOM uint32_t OCBEN            : 1;
            __IOM uint32_t OCMS             : 3;
            __IOM uint32_t OCCEN            : 1;
            __IM  uint32_t RESERVED         : 24;
        }CH3OC_B;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t IC3PSC           : 2;
            __IOM uint32_t ICFC             : 4;
            __IM  uint32_t RESERVED         : 24;
        }CH3IC_B;
    };

    /** Channel 4 compare/capture mode register */
    union
    {
        __IOM uint32_t CH4CCM;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t OCFEN            : 1;
            __IOM uint32_t OCBEN            : 1;
            __IOM uint32_t OCMS             : 3;
            __IOM uint32_t OCCEN            : 1;
            __IM  uint32_t RESERVED         : 24;
        }CH4OC_B;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t IC4PSC           : 2;
            __IOM uint32_t ICFC             : 4;
            __IM  uint32_t RESERVED         : 24;
        }CH4IC_B;
    };

    /** Channel control register 1 */
    union
    {
        __IOM uint32_t CHCTRL1;

        struct
        {
            __IOM uint32_t CH1CCEN          : 1;
            __IOM uint32_t CH1CCP           : 1;
            __IOM uint32_t CH1OCNEN         : 1;
            __IOM uint32_t CH1OCNP          : 1;
            __IOM uint32_t CH2CCEN          : 1;
            __IOM uint32_t CH2CCP           : 1;
            __IOM uint32_t CH2OCNEN         : 1;
            __IOM uint32_t CH2OCNP          : 1;
            __IM  uint32_t RESERVED         : 24;
        }CHCTRL1_B;
    };

    /** Channel control register 2 */
    union
    {
        __IOM uint32_t CHCTRL2;

        struct
        {
            __IOM uint32_t CH3CCEN          : 1;
            __IOM uint32_t CH3CCP           : 1;
            __IM  uint32_t RESERVED1        : 1;
            __IM  uint32_t RESERVED2        : 1;
            __IOM uint32_t CH4CCEN          : 1;
            __IOM uint32_t CH4CCP           : 1;
            __IM  uint32_t RESERVED3        : 1;
            __IM  uint32_t RESERVED4        : 1;
            __IM  uint32_t RESERVED5        : 24;
        }CHCTRL2_B;
    };

    /** Count register 1 */
    union
    {
        __IOM uint32_t CNT1;

        struct
        {
            __IOM uint32_t CNT              : 8;
            __IM  uint32_t RESERVED         : 24;
        }CNT1_B;
    };

    /** Count register 0 */
    union
    {
        __IOM uint32_t CNT0;

        struct
        {
            __IOM uint32_t CNT              : 8;
            __IM  uint32_t RESERVED         : 24;
        }CNT0_B;
    };

    /** divider register 1 */
    union
    {
        __IOM uint32_t PSC1;

        struct
        {
            __IOM uint32_t PSC              : 8;
            __IM  uint32_t RESERVED         : 24;
        }DIV1_B;
    };

    /** divider register 0 */
    union
    {
        __IOM uint32_t PSC0;

        struct
        {
            __IOM uint32_t PSC              : 8;
            __IM  uint32_t RESERVED         : 24;
        }DIV0_B;
    };

    /** Auto reload register 1 */
    union
    {
        __IOM uint32_t AUTORLD1;

        struct
        {
            __IOM uint32_t AUTORLD          : 8;
            __IM  uint32_t RESERVED         : 24;
        }AUTORLD1_B;
    };

    /** Auto reload register 0 */
    union
    {
        __IOM uint32_t AUTORLD0;

        struct
        {
            __IOM uint32_t AUTORLD          : 8;
            __IM  uint32_t RESERVED         : 24;
        }AUTORLD0_B;
    };

    /** repetition count register 0 */
    union
    {
        __IOM uint32_t REPCNT;

        struct
        {
            __IOM uint32_t REPCNT           : 8;
            __IM  uint32_t RESERVED         : 24;
        }REPCNT_B;
    };

    /** channel 1 compare/capture register 1 */
    union
    {
        __IOM uint32_t CH1CC1;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH1CC1_B;
    };

    /** channel 1 compare/capture register 0 */
    union
    {
        __IOM uint32_t CH1CC0;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH1CC0_B;
    };

    /** channel 2 compare/capture register 1 */
    union
    {
        __IOM uint32_t CH2CC1;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH2CC1_B;
    };

    /** channel 2 compare/capture register 0 */
    union
    {
        __IOM uint32_t CH2CC0;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH2CC0_B;
    };

    /** channel 3 compare/capture register 1 */
    union
    {
        __IOM uint32_t CH3CC1;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH3CC1_B;
    };

    /** channel 3 compare/capture register 0 */
    union
    {
        __IOM uint32_t CH3CC0;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH3CC0_B;
    };

