tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/include/apm32f00x.h
    /** channel 4 compare/capture register 1 */
    union
    {
        __IOM uint32_t CH4CC1;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH4CC1_B;
    };

    /** channel 4 compare/capture register 0 */
    union
    {
        __IOM uint32_t CH4CC0;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH4CC0_B;
    };

    /** Break control register */
    union
    {
        __IOM uint32_t BRKCTRL;

        struct
        {
            __IOM uint32_t PROTCFG          : 2;
            __IOM uint32_t IMOS             : 1;
            __IOM uint32_t RMOS             : 1;
            __IOM uint32_t BRKEN            : 1;
            __IOM uint32_t BRKPOL           : 1;
            __IOM uint32_t AOEN             : 1;
            __IOM uint32_t WOEN             : 1;
            __IM  uint32_t RESERVED         : 24;
        }BRKCTRL_B;
    };

    /** dead time setup register */
    union
    {
        __IOM uint32_t DTS;

        struct
        {
            __IOM uint32_t DTS              : 8;
            __IM  uint32_t RESERVED         : 24;
        }DTS_B;
    };

    /** idele status output register */
    union
    {
        __IOM uint32_t ISO;

        struct
        {
            __IOM uint32_t CH1ISO           : 1;
            __IOM uint32_t CH1NISO          : 1;
            __IOM uint32_t CH2ISO           : 1;
            __IOM uint32_t CH2NISO          : 1;
            __IOM uint32_t CH3ISO           : 1;
            __IOM uint32_t RESERVED1        : 1;
            __IOM uint32_t CH4ISO           : 1;
            __IM  uint32_t RESERVED         : 25;
        }ISO_B;
    };

    __IOM uint32_t RESERVED;

    /** Timer1A Channel enable register */
    union
    {
        __IOM uint32_t CHEN;

        struct
        {
            __IOM uint32_t CH1              : 1;
            __IOM uint32_t CH2              : 1;
            __IOM uint32_t CH3              : 1;
            __IOM uint32_t CH4              : 1;
            __IM  uint32_t RESERVED         : 28;
        }CHEN_B;
    };
}TMR1_T;

/**
 * @brief   Timer2
 */
typedef struct
{
    /** Control register 1 */
    union
    {
        __IOM uint32_t CTRL1;
        struct
        {
            __IOM uint32_t CNTEN            : 1;
            __IOM uint32_t NGUE             : 1;
            __IOM uint32_t UES              : 1;
            __IOM uint32_t SPMEN            : 1;
            __IM  uint32_t RESERVED1        : 3;
            __IOM uint32_t ARBEN            : 1;
            __IM  uint32_t RESERVED2        : 24;
        }CTRL1_B;
    };

    /** Control register 2 */
    union
    {
        __IOM uint32_t CTRL2;
        struct
        {
            __IM  uint32_t RESERVED1        : 4;
            __IOM uint32_t MMFC             : 3;
            __IM  uint32_t RESERVED2        : 25;
        }CTRL2_B;
    };

    /** Slave mode congrol register */
    union
    {
        __IOM uint32_t SMC;
        struct
        {
            __IOM uint32_t SMFC             : 3;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t ITC              : 3;
            __IOM uint32_t MSMEN            : 1;
            __IM  uint32_t RESERVED2        : 24;
        }SMC_B;
    };

    /** interrupt control register */
    union
    {
        __IOM uint32_t INTCTRL;
        struct
        {
            __IOM uint32_t UDIE             : 1;
            __IOM uint32_t CH1CCIE          : 1;
            __IOM uint32_t CH2CCIE          : 1;
            __IOM uint32_t CH3CCIE          : 1;
            __IM  uint32_t RESERVED1        : 2;
            __IOM uint32_t TRGIE            : 1;
            __IM  uint32_t RESERVED2        : 25;
        }INTCTRL_B;
    };

    /** status register 1 */
    union
    {
        __IOM uint32_t STS1;
        struct
        {
            __IOM uint32_t UDIF             : 1;
            __IOM uint32_t CH1CCIF          : 1;
            __IOM uint32_t CH2CCIF          : 1;
            __IOM uint32_t CH3CCIF          : 1;
            __IM  uint32_t RESERVED1        : 2;
            __IOM uint32_t TRGIF            : 1;
            __IM  uint32_t RESERVED2        : 25;
        }STS1_B;
    };

    /** status register 2 */
    union
    {
        __IOM uint32_t STS2;
        struct
        {
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t CH1RCF           : 1;
            __IOM uint32_t CH2RCF           : 1;
            __IOM uint32_t CH3RCF           : 1;
            __IM  uint32_t RESERVED2        : 28;
        }STS2_B;
    };

    /** Software control event generate register */
    union
    {
        __IOM uint32_t SCEG;
        struct
        {
            __IOM uint32_t UEG              : 1;
            __IOM uint32_t CH1CCG           : 1;
            __IOM uint32_t CH2CCG           : 1;
            __IOM uint32_t CH3CCG           : 1;
            __IM  uint32_t RESERVED1        : 2;
            __IOM uint32_t TEG              : 1;
            __IM  uint32_t RESERVED2        : 25;
        }SCEG_B;
    };

    /** Channel 1 compare/capture mode register */
    union
    {
        __IOM uint32_t CH1CCM;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t OCBEN            : 1;
            __IOM uint32_t OCMS             : 3;
            __IM  uint32_t RESERVED2        : 25;
        }CH1OC_B;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t IC1PSC           : 2;
            __IOM uint32_t ICFC             : 4;
            __IM  uint32_t RESERVED         : 24;
        }CH1IC_B;
    };

    /** Channel 2 compare/capture mode register */
    union
    {
        __IOM uint32_t CH2CCM;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t OCBEN            : 1;
            __IOM uint32_t OCMS             : 3;
            __IM  uint32_t RESERVED2        : 25;
        }CH2OC_B;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t IC2PSC           : 2;
            __IOM uint32_t ICFC             : 4;
            __IM  uint32_t RESERVED         : 24;
        }CH2IC_B;
    };

