tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/include/apm32f00x.h
    /** Count register */
    union
    {
        __IOM uint32_t CNT;

        struct
        {
            __IOM uint32_t CNT              : 8;
            __IM  uint32_t RESERVED         : 24;
        }CNT_B;
    };

    /** divider register */
    union
    {
        __IOM uint32_t PSC;

        struct
        {
            __IOM uint32_t PSC              : 3;
            __IM  uint32_t RESERVED         : 29;
        }DIV_B;
    };


    /** Auto reload register */
    union
    {
        __IOM uint32_t AUTORLD;

        struct
        {
            __IOM uint32_t AUTORLD          : 8;
            __IM  uint32_t RESERVED         : 24;
        }AUTORLD_B;
    };
}TMR4_T;

/**
 * @brief   SPI
 */
typedef struct
{
    /** Control  register 1 */
    union
    {
        __IOM uint32_t CTRL1;

        struct
        {
            __IOM uint32_t CLKPHA           : 1;
            __IOM uint32_t CLKPOL           : 1;
            __IOM uint32_t MSTMODE          : 1;
            __IOM uint32_t BRC              : 3;
            __IOM uint32_t SPIEN            : 1;
            __IOM uint32_t LSBF             : 1;
            __IM  uint32_t RESERVED         : 24;
        }CTRL1_B;
    };

    /** Control  register 2 */
    union
    {
        __IOM uint32_t CTRL2;

        struct
        {
            __IOM uint32_t ISS              : 1;
            __IOM uint32_t SSC              : 1;
            __IOM uint32_t UMRXO            : 1;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t CRCNXT           : 1;
            __IOM uint32_t CRCEN            : 1;
            __IOM uint32_t BMTX             : 1;
            __IOM uint32_t BMEN             : 1;
            __IM  uint32_t RESERVED2        : 24;
        }CTRL2_B;
    };

    /** Interrupt control  register */
    union
    {
        __IOM uint32_t INTCTRL;

        struct
        {
            __IM  uint32_t RESERVED1        : 4;
            __IOM uint32_t WUPIE            : 1;
            __IOM uint32_t ERRIE            : 1;
            __IOM uint32_t RXBNEIE          : 1;
            __IOM uint32_t TXBEIE           : 1;
            __IM  uint32_t RESERVED2        : 24;
        }INTCTRL_B;
    };

    /** Status register */
    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IOM uint32_t RXBNEF           : 1;
            __IOM uint32_t TXBEF            : 1;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t WUPF             : 1;
            __IOM uint32_t CRCEF            : 1;
            __IOM uint32_t MMEF             : 1;
            __IOM uint32_t RXOF             : 1;
            __IOM uint32_t BUSYF            : 1;
            __IM  uint32_t RESERVED2        : 24;
        }STS_B;
    };

    /** Data register */
    union
    {
        __IOM uint32_t DATA;

        struct
        {
            __IOM uint32_t DATA             : 8;
            __IM  uint32_t RESERVED2        : 24;
        }DATA_B;
    };

    /** CRC polynomial register */
    union
    {
        __IOM uint32_t CRCPOLY;

        struct
        {
            __IOM uint32_t CRCPOLY          : 8;
            __IM  uint32_t RESERVED2        : 24;
        }CRCPOLY_B;
    };

    /** Rx CRC register */
    union
    {
        __IOM uint32_t RXCRC;

        struct
        {
            __IOM uint32_t RXCRC            : 8;
            __IM  uint32_t RESERVED2        : 24;
        }RXCRC_B;
    };

    /** Tx CRC register */
    union
    {
        __IOM uint32_t TXCRC;

        struct
        {
            __IOM uint32_t TXCRC            : 8;
            __IM  uint32_t RESERVED2        : 24;
        }TXCRC_B;
    };
}SPI_T;

/**
 * @brief   ADC
 */
typedef struct
{
    /** Data buffer */
    __IOM uint32_t DATABUF[20];

    __IM uint32_t RESERVED[12];

    /** Control  status register 1 */
    union
    {
        __IOM uint32_t CSTS;

        struct
        {
            __IOM uint32_t CHSEL            : 4;
            __IOM uint32_t AWDIE            : 1;
            __IOM uint32_t CCIE             : 1;
            __IOM uint32_t AWDF             : 1;
            __IOM uint32_t CCF              : 1;
            __IM  uint32_t RESERVED2        : 24;
        }CSTS_B;
    };

    /** Control register 1 */
    union
    {
        __IOM uint32_t CTRL1;

        struct
        {
            __IOM uint32_t ADCON            : 1;
            __IOM uint32_t CCM              : 1;
            __IM  uint32_t RESERVED1        : 2;
            __IOM uint32_t DIVSEL           : 3;
            __IM  uint32_t RESERVED2        : 25;
        }CTRL1_B;
    };

    /** Control register 2 */
    union
    {
        __IOM uint32_t CTRL2;

        struct
        {
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t SMEN             : 1;
            __IM  uint32_t RESERVED2        : 1;
            __IOM uint32_t DAM              : 1;
            __IOM uint32_t ETS              : 2;
            __IOM uint32_t ETEN             : 1;
            __IM  uint32_t RESERVED3        : 25;
        }CTRL2_B;
    };

    /** Control register 3 */
    union
    {
        __IOM uint32_t CTRL3;

        struct
        {
            __IM  uint32_t RESERVED1        : 6;
            __IOM uint32_t OVRF             : 1;
            __IOM uint32_t DBEN             : 1;
            __IM  uint32_t RESERVED2        : 24;
        }CTRL3_B;
    };

    /** DATA register 1 */
    union
    {
        __IOM uint32_t DATA1;

        struct
        {
            __IOM uint32_t DATA             : 8;
            __IM  uint32_t RESERVED         : 24;
        }DATA1_B;
    };

    /** DATA register 0 */
    union
    {
        __IOM uint32_t DATA0;

        struct
        {
            __IOM uint32_t DATA             : 8;
            __IM  uint32_t RESERVED         : 24;
        }DATA0_B;
    };

    /** Schmitt trigger disable register 1 */
    union
    {
        __IOM uint32_t STD1;

        struct
        {
            __IOM uint32_t STD              : 8;
            __IM  uint32_t RESERVED         : 24;
        }STD1_B;
    };

    /** Schmitt trigger disable register 0 */
    union
    {
        __IOM uint32_t STD0;

        struct
        {
            __IOM uint32_t STD              : 8;
            __IM  uint32_t RESERVED         : 24;
        }STD0_B;
    };

