tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/include/apm32f00x.h
    /** Analog Watch Dog high threshold register 1 */
    union
    {
        __IOM uint32_t AWDHT1;

        struct
        {
            __IOM uint32_t THRESHOLD        : 8;
            __IM  uint32_t RESERVED         : 24;
        }AWDHT1_B;
    };

    /** Analog Watch Dog high threshold register 0 */
    union
    {
        __IOM uint32_t AWDHT0;

        struct
        {
            __IOM uint32_t THRESHOLD        : 4;
            __IM  uint32_t RESERVED         : 28;
        }AWDHT0_B;
    };

    /** Analog Watch Dog low threshold register 1 */
    union
    {
        __IOM uint32_t AWDLT1;

        struct
        {
            __IOM uint32_t THRESHOLD        : 8;
            __IM  uint32_t RESERVED         : 24;
        }AWDLT1_B;
    };

    /** Analog Watch Dog low threshold register 0 */
    union
    {
        __IOM uint32_t AWDLT0;

        struct
        {
            __IOM uint32_t THRESHOLD        : 4;
            __IM  uint32_t RESERVED         : 28;
        }AWDLT0_B;
    };

    /** Analog Watch Dog status register 1 */
    union
    {
        __IOM uint32_t AWDS1;

        struct
        {
            __IOM uint32_t AWDS             : 8;
            __IM  uint32_t RESERVED         : 24;
        }AWDS1_B;
    };

    /** Analog Watch Dog status register 0 */
    union
    {
        __IOM uint32_t AWDS0;

        struct
        {
            __IOM uint32_t AWDS             : 8;
            __IM  uint32_t RESERVED         : 24;
        }AWDS0_B;
    };

    /** Analog Watch Dog enable register 1 */
    union
    {
        __IOM uint32_t AWDEN1;

        struct
        {
            __IOM uint32_t AWDEN             : 8;
            __IM  uint32_t RESERVED         : 24;
        }AWDEN1_B;
    };

    /** Analog Watch Dog enable register 0 */
    union
    {
        __IOM uint32_t AWDEN0;

        struct
        {
            __IOM uint32_t AWDEN             : 8;
            __IM  uint32_t RESERVED         : 24;
        }AWDEN0_B;
    };

    /** Control register 4 */
    union
    {
        __IOM uint32_t CTRL4;

        struct
        {
            __IOM  uint32_t DISH            : 1;
            __IOM  uint32_t GCMP            : 1;
            __IOM  uint32_t DFS             : 1;
            __IM  uint32_t RESERVED         : 29;
        }CTRL4_B;
    };

    /** Offset register */
    union
    {
        __IOM uint32_t OFFSET;

        struct
        {
            __IOM uint32_t OFFSET           : 8;
            __IM  uint32_t RESERVED         : 24;
        }OFFSET_B;
    };
}ADC_T;

/**
 * @brief   External interrupt
 */
typedef struct
{
    /** Control register 1 */
    union
    {
        __IOM uint32_t CTRL1;

        struct
        {
            __IOM uint32_t PAIT             : 2;
            __IOM uint32_t PBIT             : 2;
            __IOM uint32_t PCIT             : 2;
            __IOM uint32_t PDIT             : 2;
            __IM  uint32_t RESERVED         : 24;
        }CTRL1_B;
    };

    /** Control register 2 */
    union
    {
        __IOM uint32_t CTRL2;

        struct
        {
            __IM  uint32_t RESERVED1        : 2;
            __IOM uint32_t NMIT             : 1;
            __IM  uint32_t RESERVED2        : 29;
        }CTRL2_B;
    };

    /** Clear register */
    union
    {
        __IOM uint32_t CLR;

        struct
        {
            __IOM uint32_t PAIC             : 1;
            __IOM uint32_t PBIC             : 1;
            __IOM uint32_t PCIC             : 1;
            __IOM uint32_t PDIC             : 1;
            __IM  uint32_t RESERVED1        : 2;
            __IOM uint32_t NMIC             : 1;
            __IM  uint32_t RESERVED2        : 25;
        }CLR_B;
    };
}EINT_T;

/**
 * @brief   Independent watch dog
 */
typedef struct
{
    /** Keyword register */
    union
    {
        __IOM uint32_t KEYWORD;

        struct
        {
            __IOM uint8_t KEY               : 8;
            __IM  uint32_t RESERVED         : 24;
        }KEYWORD_B;
    };

    /** divider register */
    union
    {
        __IOM uint32_t PSC;

        struct
        {
            __IOM uint8_t  PSC              : 3;
            __IM  uint32_t RESERVED         : 29;
        }DIV_B;
    };

    /** Counter reload register */
    union
    {
        __IOM uint32_t CNTRLD;

        struct
        {
            __IOM uint8_t CNTRLD            : 8;
            __IM  uint32_t RESERVED         : 24;
        }CNTRLD_B;
    };
}IWDT_T;

/**
 * @brief   Windows watch dog
 */
typedef struct
{

    /** Control register */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t CNT              : 7;
            __IOM uint32_t WWDTEN           : 1;
            __IM  uint32_t RESERVED         : 24;
        }CTRL_B;
    };

    /** Control data register */
    union
    {
        __IOM uint32_t WDDATA;

        struct
        {
            __IOM uint32_t WINCNT           : 7;
            __IOM uint32_t WWDTEN           : 1;
            __IM  uint32_t RESERVED         : 24;
        }WDDATA_B;
    };
}WWDT_T;

/**
 * @brief   BUZZER
 */
typedef struct
{
    /** Control status register */
    union
    {
        __IOM uint32_t CSTS;

        struct
        {
            __IOM uint32_t DIV              : 5;
            __IOM uint32_t BUZEN            : 1;
            __IOM uint32_t BOFS             : 2;
            __IM  uint32_t RESERVED         : 24;
        }CSTS_B;
    };
}BUZZER_T;

/**
 * @brief   Wakeup timer
 */
typedef struct
{
    /** Control status register */
    union
    {
        __IOM uint32_t CSTS;

        struct
        {
            __IOM uint32_t CFMEN            : 1;
            __IM  uint32_t RESERVED1        : 3;
            __IOM uint32_t WUPTEN           : 1;
            __IOM uint32_t WUPIF            : 1;
            __IM  uint32_t RESERVED2        : 26;
        }CSTS_B;
    };

    /** Divider register */
    union
    {
        __IOM uint32_t DIV;

        struct
        {
            __IOM uint32_t DIV              : 6;
            __IM  uint32_t RESERVED         : 26;
        }DIV_B;
    };

    /** Control status register */
    union
    {
        __IOM uint32_t TBC;

        struct
        {
            __IOM uint32_t TBC              : 4;
            __IM  uint32_t RESERVED         : 28;
        }TBC_B;
    };
}WUPT_T;

/**
  * @brief Flash memory controller (FMC)
  */
typedef struct
{
    /** Flash memory control register 1 */
    union
    {
        __IOM uint32_t CTRL1;

        struct
        {
            __IOM uint32_t LATENCY          : 3;
            __IOM uint32_t HCAEN            : 1;
            __IOM uint32_t PBEN             : 1;
            __IM  uint32_t PBSF             : 1;
            __IM  uint32_t RESERVED         : 26;
        } CTRL1_B;
    };

