tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/include/apm32f00x.h
    /** key register */
    union
    {
        __OM  uint32_t KEY;

        struct
        {
            __OM  uint32_t KEY              : 32;
        } KEY_B;
    } ;

    /** option byte key register */
    union
    {
        __OM  uint32_t OBKEY;

        struct
        {
            __OM  uint32_t KEY              : 32;
        } OBKEY_B;
    } ;

    /** status register */
    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IM  uint32_t BUSYF            : 1;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t PEF              : 1;
            __IM  uint32_t RESERVED2        : 1;
            __IOM uint32_t WPEF             : 1;
            __IOM uint32_t OCF              : 1;
            __IM  uint32_t RESERVED3        : 26;
        } STS_B;
    } ;

    /** control register 2 */
    union
    {
        __IOM uint32_t CTRL2;

        struct
        {
            __IOM uint32_t PG               : 1;
            __IOM uint32_t PAGEERA          : 1;
            __IOM uint32_t MASSERA          : 1;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t OBP              : 1;
            __IOM uint32_t OBE              : 1;
            __IOM uint32_t STA              : 1;
            __IOM uint32_t LOCK             : 1;
            __IM  uint32_t RESERVED2        : 1;
            __IOM uint32_t OBWEN            : 1;
            __IOM uint32_t ERRIE            : 1;
            __IM  uint32_t RESERVED3        : 1;
            __IOM uint32_t OCIE             : 1;
            __IM  uint32_t RESERVED4        : 19;
        } CTRL2_B;
    } ;

    /** address register */
    union
    {
        __IOM uint32_t ADDR;

        struct
        {
            __IOM uint32_t ADDR             : 32;
        } ADDR_B;
    } ;

    __IM  uint32_t  RESERVED;

    /** Option byte control/status register */
    union
    {
        __IOM uint32_t OBCS;

        struct
        {
            __IM  uint32_t OBE              : 1;
            __IOM uint32_t READPROT         : 1;
            __IM  uint32_t WWDTSW           : 1;
            __IM  uint32_t WWDTRST          : 1;
            __IM  uint32_t IWDTSW           : 1;
            __IM  uint32_t LIRCEN           : 1;
            __IM  uint32_t HIRCTRIM         : 1;
            __IM  uint32_t RESERVED1        : 3;
            __IM  uint32_t DATA0            : 8;
            __IM  uint32_t DATA1            : 8;
            __IM  uint32_t RESERVED2        : 6;
        } OBCS_B;
    } ;

    /** Write protection register */
    union
    {
        __IM uint32_t WRTPROT;

        struct
        {
            __IM uint32_t WRTPROT           : 32;
        } WRTPROT_B;
    } ;

    /** Low power mode register */
    union
    {
        __IOM uint32_t LPM;

        struct
        {
            __IOM uint32_t HALT             : 1;
            __IOM uint32_t AHALT            : 1;
            __IM  uint32_t RESERVED         : 30;
        } LPM_B;
    } ;

    /** tpower on register */
    union
    {
        __IOM uint32_t TPO;

        struct
        {
            __IOM uint32_t TPO             : 8;
            __IM  uint32_t RESERVED         : 24;
        } TPO_B;
    } ;
} FMC_T;

/**
  * @brief Option Bytes Registers
  */
typedef struct
{
    __IOM uint16_t READPROT;

    union
    {
        __IOM uint16_t USER;

        struct
        {
            __IOM uint16_t WWDTSW           : 1;
            __IOM uint16_t WWDTRST          : 1;
            __IOM uint16_t IWDTSW           : 1;
            __IOM uint16_t LIRCEN           : 1;
            __IOM uint16_t HIRCTRIM         : 1;
            __IOM uint16_t RESERVED         : 3;
            __IOM uint16_t nUSER            : 8;
        } USER_B;
    } ;

    __IOM uint16_t DATA0;
    __IOM uint16_t DATA1;
    __IOM uint16_t WRTPROT0;
    __IOM uint16_t WRTPROT1;
    __IOM uint16_t WRTPROT2;
    __IOM uint16_t WRTPROT3;
    __IOM uint16_t AFR;
    uint16_t RESERVED;
    __IOM uint16_t HXTCNT;

    union
    {
         __IOM uint16_t CLKOPT;

        struct
        {
            __IOM uint16_t WUPTDIV              : 2;
            __IOM uint16_t WUPTCS               : 1;
            __IOM uint16_t EXTCLK               : 1;
            __IOM uint16_t RESERVED             : 4;
            __IOM uint16_t nCLKOPT              : 8;
        } CLKOPT_B;
    } ;
} OB_T;

/**@} end of group Device_Register*/

/** FMC base address in the alias region */
#define FMC_BASE            ((uint32_t)0x00000000)
/** SRAM base address in the alias region */
#define SRAM_BASE           ((uint32_t)0x20000000)
/** Peripheral base address in the alias region */
#define PERIPH_BASE         ((uint32_t)0x40000000)

/*!< Peripheral memory map */
#define APBPERIPH_BASE      PERIPH_BASE
#define AHBPERIPH_BASE      (PERIPH_BASE + 0x00010000)

#define GPIOA_BASE          (APBPERIPH_BASE + 0x00000000)
#define GPIOB_BASE          (APBPERIPH_BASE + 0x00000400)
#define GPIOC_BASE          (APBPERIPH_BASE + 0x00000800)
#define GPIOD_BASE          (APBPERIPH_BASE + 0x00000C00)
#define TMR1A_BASE          (APBPERIPH_BASE + 0x00001000)
#define USART2_BASE         (APBPERIPH_BASE + 0x00001400)
#define EINT_BASE           (APBPERIPH_BASE + 0x00001800)
#define WWDT_BASE           (APBPERIPH_BASE + 0x00001C00)
#define IWDT_BASE           (APBPERIPH_BASE + 0x00002000)
#define WAKEUP_BASE         (APBPERIPH_BASE + 0x00002400)
#define BUZZER_BASE         (APBPERIPH_BASE + 0x00002800)
#define SPI_BASE            (APBPERIPH_BASE + 0x00002C00)
#define I2C_BASE            (APBPERIPH_BASE + 0x00003000)
#define USART1_BASE         (APBPERIPH_BASE + 0x00003400)
#define TMR1_BASE           (APBPERIPH_BASE + 0x00003800)
#define TMR2_BASE           (APBPERIPH_BASE + 0x00003C00)
#define TMR4_BASE           (APBPERIPH_BASE + 0x00004000)
#define ADC_BASE            (APBPERIPH_BASE + 0x00004400)
#define USART3_BASE         (APBPERIPH_BASE + 0x00004800)

#define RCM_BASE            (AHBPERIPH_BASE + 0x00000000)
#define FMC_R_BASE          (AHBPERIPH_BASE + 0x00001000)
#define OB_BASE             (0x00020400)


#define GPIOA               ((GPIO_T *) GPIOA_BASE)
#define GPIOB               ((GPIO_T *) GPIOB_BASE)
#define GPIOC               ((GPIO_T *) GPIOC_BASE)
#define GPIOD               ((GPIO_T *) GPIOD_BASE)

#define EINT                ((EINT_T *) EINT_BASE)
#define WWDT                ((WWDT_T *) WWDT_BASE)
#define IWDT                ((IWDT_T *) IWDT_BASE)
#define WUPT                ((WUPT_T *) WAKEUP_BASE)
#define BUZZER              ((BUZZER_T *) BUZZER_BASE)
#define SPI                 ((SPI_T *) SPI_BASE)
#define I2C                 ((I2C_T *) I2C_BASE)
#define USART1              ((USART_T *) USART1_BASE)
#define USART2              ((USART_T *) USART2_BASE)
#define USART3              ((USART_T *) USART3_BASE)
#define TMR1                ((TMR1_T *) TMR1_BASE)
#define TMR1A               ((TMR1_T *) TMR1A_BASE)
#define TMR2                ((TMR2_T *) TMR2_BASE)
#define TMR4                ((TMR4_T *) TMR4_BASE)
#define ADC                 ((ADC_T *) ADC_BASE)
#define RCM                 ((RCM_T *) RCM_BASE)

#define FMC                 ((FMC_T *) FMC_R_BASE)
#define OB                  ((OB_T *) OB_BASE)


/* Define one bit mask */
#define BIT0                0x00000001
#define BIT1                0x00000002
#define BIT2                0x00000004
#define BIT3                0x00000008
#define BIT4                0x00000010
#define BIT5                0x00000020
#define BIT6                0x00000040
#define BIT7                0x00000080
#define BIT8                0x00000100
#define BIT9                0x00000200
#define BIT10               0x00000400
#define BIT11               0x00000800
#define BIT12               0x00001000
#define BIT13               0x00002000
#define BIT14               0x00004000
#define BIT15               0x00008000
#define BIT16               0x00010000
#define BIT17               0x00020000
#define BIT18               0x00040000
#define BIT19               0x00080000
#define BIT20               0x00100000
#define BIT21               0x00200000
#define BIT22               0x00400000
#define BIT23               0x00800000
#define BIT24               0x01000000
#define BIT25               0x02000000
#define BIT26               0x04000000
#define BIT27               0x08000000
#define BIT28               0x10000000
#define BIT29               0x20000000
#define BIT30               0x40000000
#define BIT31               0x80000000

#define SET_BIT(REG, BIT)     ((REG) |= (BIT))

#define CLEAR_BIT(REG, BIT)   ((REG) &= ~(BIT))

#define READ_BIT(REG, BIT)    ((REG) & (BIT))

#define CLEAR_REG(REG)        ((REG) = (0x0))

#define WRITE_REG(REG, VAL)   ((REG) = (VAL))

#define READ_REG(REG)         ((REG))

#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))

/**@} end of group CMSIS_Device*/

#ifdef __cplusplus
}
#endif

#endif /* __APM32F0XX_H */
